IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN0_ECC_MCAN0_ECC.xml
<module name="MCAN0_ECC_MCAN0_ECC" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCAN0_ECC_REV" acronym="MCAN0_ECC_REV" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x29" description="RTL version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor version" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_ECC_VECTOR" acronym="MCAN0_ECC_VECTOR" offset="0x8" width="32" description="">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete, write of any value will clear this bit. Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field." range="24" rwaccess="RW"/> 
		<bitfield id="RD_SVBUS_ADDR" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS. Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="15" rwaccess="RW"/> 
		<bitfield id="ECC_VEC" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_STAT" acronym="MCAN0_ECC_STAT" offset="0xC" width="32" description="">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x2" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_ECC_CTRL" acronym="MCAN0_ECC_CTRL" offset="0x14" width="32" description="">
		<bitfield id="NU3" width="23" begin="31" end="9" resetval="0x0" description="TI Internal : Reserved" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="CHECK_TIMEOUT" width="1" begin="8" end="8" resetval="0x1" description="TI Internal : Check timeout" range="8" rwaccess="WO"/> 
		<bitfield id="CHECK_PARITY" width="1" begin="7" end="7" resetval="0x1" description="TI Internal : Check Parity" range="7" rwaccess="WO"/> 
		<bitfield id="ERROR_ONCE" width="1" begin="6" end="6" resetval="0x0" description="TI Internal : Force Error only once" range="6" rwaccess="WO"/> 
		<bitfield id="FORCE_N_ROW" width="1" begin="5" end="5" resetval="0x0" description="TI Internal : Force Error on any RAM read" range="5" rwaccess="WO"/> 
		<bitfield id="FORCE_DED" width="1" begin="4" end="4" resetval="0x0" description="TI Internal : Force Double Bit Error" range="4" rwaccess="WO"/> 
		<bitfield id="FORCE_SEC" width="1" begin="3" end="3" resetval="0x0" description="TI Internal : Force Single Bit Error" range="3" rwaccess="WO"/> 
		<bitfield id="EN_RMW" width="1" begin="2" end="2" resetval="0x1" description="TI Internal : Enable rmw" range="2" rwaccess="WO"/> 
		<bitfield id="ECC_CHK" width="1" begin="1" end="1" resetval="0x1" description="TI Internal : Enable ECC check" range="1" rwaccess="WO"/> 
		<bitfield id="ECC_EN" width="1" begin="0" end="0" resetval="0x1" description="TI Internal : Enable ECC" range="0" rwaccess="WO"/>
	</register>
	<register id="MCAN0_ECC_ERR_CTRL1" acronym="MCAN0_ECC_ERR_CTRL1" offset="0x18" width="32" description="">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="TI Internal : Row address where single or double-bit error needs to be applied. This is ignored if force_n_row is set" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_ERR_CTRL2" acronym="MCAN0_ECC_ERR_CTRL2" offset="0x1C" width="32" description="">
		<bitfield id="ECC_BIT2" width="16" begin="31" end="16" resetval="0x0" description="TI Internal : Data bit that needs to be flipped if double bit error needs to be forced" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="ECC_BIT1" width="16" begin="15" end="0" resetval="0x0" description="TI Internal : Data bit that needs to be flipped when force_sec is set" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_ERR_STAT1" acronym="MCAN0_ECC_ERR_STAT1" offset="0x20" width="32" description="">
		<bitfield id="ECC_BIT1_STS" width="16" begin="31" end="16" resetval="0x0" description="TI Internal : Data bit that corresponds to the single-bit error" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CLR_ECC_CTRL_REG" width="1" begin="15" end="15" resetval="0x0" description="TI Internal : Clear Ctrl Reg Error Status. Write 1 to clear. This bit is self clearing." range="15" rwaccess="WO"/> 
		<bitfield id="CLR_ECC_PAR" width="2" begin="14" end="13" resetval="0x0" description="TI Internal : Clear Parity Error Status. Write 1 to clear. This bit is self clearing." range="14 - 13" rwaccess="WO"/> 
		<bitfield id="CLR_ECC_OTHER" width="1" begin="12" end="12" resetval="0x0" description="TI Internal : Clear Other Error Status. Write 1 to clear. This bit is self clearing." range="12" rwaccess="WO"/> 
		<bitfield id="CLR_ECC_DED" width="2" begin="11" end="10" resetval="0x0" description="TI Internal : Clear Double Bit Error Status. Write 1 to clear. This bit is self clearing." range="11 - 10" rwaccess="WO"/> 
		<bitfield id="CLR_ECC_SEC" width="2" begin="9" end="8" resetval="0x0" description="TI Internal : Clear Single Bit Error Status. Write 1 to clear. This bit is self clearing." range="9 - 8" rwaccess="WO"/> 
		<bitfield id="ECC_CTRL_REG" width="1" begin="7" end="7" resetval="0x0" description="TI Internal : Force ctrl reg pending interrupt. Write 1 to set. This bit is self clearing." range="7" rwaccess="WO"/> 
		<bitfield id="ECC_PAR" width="2" begin="6" end="5" resetval="0x0" description="TI Internal : Force ECC parity pending interrupt. Write 1 to set. This bit is self clearing." range="6 - 5" rwaccess="WO"/> 
		<bitfield id="ECC_OTHER" width="1" begin="4" end="4" resetval="0x0" description="TI Internal : Force ECC other pending interrupt. Write 1 to set. This bit is self clearing." range="4" rwaccess="WO"/> 
		<bitfield id="ECC_DED" width="2" begin="3" end="2" resetval="0x0" description="TI Internal : Force ECC DED pending interrupt. Write 1 to set. This bit is self clearing." range="3 - 2" rwaccess="WO"/> 
		<bitfield id="ECC_SEC" width="2" begin="1" end="0" resetval="0x0" description="TI Internal : Force ECC SEC pending interrupt. Write 1 to set. This bit is self clearing." range="1 - 0" rwaccess="WO"/>
	</register>
	<register id="MCAN0_ECC_ERR_STAT2" acronym="MCAN0_ECC_ERR_STAT2" offset="0x24" width="32" description="">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="TI Internal : Row address where the single or double-bit error has occurred" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_ECC_ERR_STAT3" acronym="MCAN0_ECC_ERR_STAT3" offset="0x28" width="32" description="">
		<bitfield id="NU6" width="22" begin="31" end="10" resetval="0x0" description="TI Internal : Reserved" range="31 - 10" rwaccess="RO"/> 
		<bitfield id="CLR_TIMEOUT_PEND" width="1" begin="9" end="9" resetval="0x0" description="TI Internal : Clear timeout pending" range="9" rwaccess="WO"/> 
		<bitfield id="NU5" width="7" begin="8" end="2" resetval="0x0" description="TI Internal : Reserved" range="8 - 2" rwaccess="RO"/> 
		<bitfield id="TIMEOUT_PEND" width="1" begin="1" end="1" resetval="0x0" description="TI Internal : Timeout pending" range="1" rwaccess="WO"/> 
		<bitfield id="NU4" width="1" begin="0" end="0" resetval="0x0" description="TI Internal : Reserved" range="0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_ECC_SEC_EOI_REG" acronym="MCAN0_ECC_SEC_EOI_REG" offset="0x3C" width="32" description="">
		<bitfield id="SEC_EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register. Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field. This bit is self clearing, reading this bit will return 0." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_SEC_STATUS_REG0" acronym="MCAN0_ECC_SEC_STATUS_REG0" offset="0x40" width="32" description="">
		<bitfield id="CTRL_EDC_VBUSS_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for ctrl_edc_vbuss_pend." range="1" rwaccess="RO"/> 
		<bitfield id="SEC_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for msgmem_pend." range="0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_ECC_SEC_ENABLE_SET_REG0" acronym="MCAN0_ECC_SEC_ENABLE_SET_REG0" offset="0x80" width="32" description="">
		<bitfield id="CTRL_EDC_VBUSS_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for ctrl_edc_vbuss_pend. Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="1" rwaccess="RW"/> 
		<bitfield id="SEC_EN_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for msgmem_pend.  Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_SEC_ENABLE_CLR_REG0" acronym="MCAN0_ECC_SEC_ENABLE_CLR_REG0" offset="0xC0" width="32" description="">
		<bitfield id="CTRL_EDC_VBUSS_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for ctrl_edc_vbuss_pend. Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field.  Reading this bit will return 0." range="1" rwaccess="RW"/> 
		<bitfield id="SEC_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for msgmem_pend.  Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field. Reading this bit will return 0." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_DED_EOI_REG" acronym="MCAN0_ECC_DED_EOI_REG" offset="0x13C" width="32" description="">
		<bitfield id="DED_EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register. Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field. This bit is self clearing, reading this bit will return 0." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_DED_STATUS_REG0" acronym="MCAN0_ECC_DED_STATUS_REG0" offset="0x140" width="32" description="">
		<bitfield id="CTRL_EDC_VBUSS_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for ctrl_edc_vbuss_pend." range="1" rwaccess="RO"/> 
		<bitfield id="DED_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for msgmem_pend." range="0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_ECC_DED_ENABLE_SET_REG0" acronym="MCAN0_ECC_DED_ENABLE_SET_REG0" offset="0x180" width="32" description="">
		<bitfield id="CTRL_EDC_VBUSS_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for ctrl_edc_vbuss_pend. Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="1" rwaccess="RW"/> 
		<bitfield id="DED_EN_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for msgmem_pend.  Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_DED_ENABLE_CLR_REG0" acronym="MCAN0_ECC_DED_ENABLE_CLR_REG0" offset="0x1C0" width="32" description="">
		<bitfield id="CTRL_EDC_VBUSS_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for ctrl_edc_vbuss_pend. Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field.  Reading this bit will return 0." range="1" rwaccess="RW"/> 
		<bitfield id="DED_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for msgmem_pend.  Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field. Reading this bit will return 0." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_AGGR_ENABLE_SET" acronym="MCAN0_ECC_AGGR_ENABLE_SET" offset="0x200" width="32" description="">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for svbus timeout errors. Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="1" rwaccess="RW"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for parity errors.  Writing 1 to any bit will set the corresponding bit. Reads do not alter the value of the field." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_AGGR_ENABLE_CLR" acronym="MCAN0_ECC_AGGR_ENABLE_CLR" offset="0x204" width="32" description="">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear for svbus timeout errors. Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field.  Reading this bit will return 0." range="1" rwaccess="RW"/> 
		<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear for parity errors.  Writing 1 to any bit will clear the corresponding bits. Reads do not alter the value of the field.  Reading this bit will return 0." range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_AGGR_STATUS_SET" acronym="MCAN0_ECC_AGGR_STATUS_SET" offset="0x208" width="32" description="">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="Interrupt status set for svbus timeout errors. A write to increment field. Writing a value to this field increment the field value by the value written. Reads do not alter the value of the field." range="3 - 2" rwaccess="RW"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="Interrupt status set for parity errors. A write to increment field. Writing a value to this field increment the field value by the value written. Reads do not alter the value of the field." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_ECC_AGGR_STATUS_CLR" acronym="MCAN0_ECC_AGGR_STATUS_CLR" offset="0x20C" width="32" description="">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="Interrupt status clear for svbus timeout errors. A write to decrement field. Writing a value to this field decrements the field value by the value written. Reads do not alter the value of the field." range="3 - 2" rwaccess="RW"/> 
		<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="Interrupt status clear for parity errors. A write to decrement field. Writing a value to this field decrements the field value by the value written. Reads do not alter the value of the field." range="1 - 0" rwaccess="RW"/>
	</register>
</module>